//----------------------------------------------------------------------
//  pragma
//----------------------------------------------------------------------

//----------------------------------------------------------------------
//  include
//----------------------------------------------------------------------
#include "r_cg_macrodriver.h"
#include "r_cg_wdt.h"

#include "myproj.h"
#include "extern.h"

//----------------------------------------------------------------------
//  static variable
//----------------------------------------------------------------------

//----------------------------------------------------------------------
//  function table
//----------------------------------------------------------------------
static void fpFunc__(void);
static void fpFunc01(void);

static FUNCPTR fpTable[eMAIN_MODE_MAX][mTIMER_EVE_MAX] = {
		// 1ms		10ms			100ms			500ms
		fpFunc01, fpFunc__, fpFunc__, fpFunc__, //	デフォルトモード
		fpFunc01, fpFunc__, fpFunc__, fpFunc__, //	通常モード
		fpFunc01, fpFunc__, fpFunc__, fpFunc__, //	エラーモード
		fpFunc01, fpFunc__, fpFunc__, fpFunc__, //	検査モード
};

//----------------------------------------------------------------------
//  function
//----------------------------------------------------------------------
void mainCtrl(void)
{
	BYTE i;
	BYTE eve;

	for (i = 0; i < mTIMER_EVE_MAX; i++)
	{
		eve = (BYTE)(g_timer >> i) & 0x01;

		if (eve)
		{
			fpTable[g_mode][i]();

			g_timer &= ~(0x0001 << i);
		}
	}
}

static void fpFunc__(void)
{
	__nop();
}

static void fpFunc01(void)
{
	R_WDT_Restart();

	serialCtrl();
	ledCtrl();
}

/************************************************************************/
/*  END OF FILE																													*/
/************************************************************************/
